## Plan Result (688: zr_sbox_acr - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.cft_developers_acr_pull[&#34;hmctssbox&#34;]
  * azurerm_role_assignment.sds_developers_acr_pull[&#34;hmctssbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.cft_developers_acr_pull["hmctssbox"] will be created
  + resource "azurerm_role_assignment" "cft_developers_acr_pull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sds_developers_acr_pull["hmctssbox"] will be created
  + resource "azurerm_role_assignment" "sds_developers_acr_pull" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 688: zr_sbox_acr - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":29,"Program":"tfcmt","SHA1":"","Target":"688: zr_sbox_acr - TerraformPlanApply","Vars":{}} -->